jxi/app/controllers/columns_controller.rb

  def index
    @table = Table.find(params[:table_id])
---
SELECT * FROM "tables" WHERE ("tables"."id" = 5)

  def show
    @table = Table.find(params[:table_id])
    @column = @table.columns.find(params[:id])
---
SELECT * FROM "tables" WHERE ("tables"."id" = 5)
SELECT * FROM "columns" WHERE ("columns"."id" = 1 AND ("columns".table_id = 5))

  def new
    @table = Table.find(params[:table_id])
---
SELECT * FROM "tables" WHERE ("tables"."id" = 5)

  def create
    @table = Table.find(params[:table_id])
    @column = @table.columns.build(params[:column])
    if @column.save
---
SELECT * FROM "tables" WHERE ("tables"."id" = 5)
INSERT INTO "columns" ("name", "created_at", "table_id", "updated_at", "column_type", "null") VALUES('test col', '2010-04-24 20:25:06', 7, '2010-04-24 20:25:06', 'string', 't')

  def edit
    @table = Table.find(params[:table_id])
    @column = @table.columns.find(params[:id])
---
SELECT * FROM "tables" WHERE ("tables"."id" = 7)
SELECT * FROM "columns" WHERE ("columns"."id" = 5 AND ("columns".table_id = 7))

  def destroy
    @table = Table.find(params[:table_id])
    @column = Column.find(params[:id])
    @column.destroy
---
SELECT * FROM "tables" WHERE ("tables"."id" = 7)
SELECT * FROM "columns" WHERE ("columns"."id" = 2)
DELETE FROM "columns" WHERE "id" = 2