jxi/app/controllers/tables_controller.rb

  def index
    @database = Database.find(params[:database_id])
---
SELECT * FROM "databases" WHERE ("databases"."id" = 2)

  def show
    @database = Database.find(params[:database_id])
    @table = @database.tables.find(params[:id])
---
SELECT * FROM "databases" WHERE ("databases"."id" = 2)
SELECT * FROM "tables" WHERE ("tables"."id" = 1 AND ("tables".database_id = 2))

  def new
    @database = Database.find(params[:database_id])
---
SELECT * FROM "databases" WHERE ("databases"."id" = 2)

  def create
    @database = Database.find(params[:database_id])
    @table = @database.tables.build(params[:table])
    if @table.save
---
SELECT * FROM "databases" WHERE ("databases"."id" = 2)
INSERT INTO "tables" ("name", "created_at", "updated_at", "database_id") VALUES('test table', '2010-04-24 16:36:50', '2010-04-24 16:36:50', 2)

  def edit
    @database = Database.find(params[:database_id])
    @table = @database.tables.find(params[:id])
---
SELECT * FROM "databases" WHERE ("databases"."id" = 3)
SELECT * FROM "tables" WHERE ("tables"."id" = 5 AND ("tables".database_id = 3))